[
  {
    "__typename": "Pokemon",
    "name": "Pikachu",
    "slug": "pikachu",
    "sku": "pikachu",
    "description": "Thunder mouse",
    "fullDescription": "Pikachu (Japanese: ピカチュウ Pikachu) is an Electric-type Pokémon introduced in Generation I. It evolves from Pichu when leveled up with high friendship and evolves into Raichu when exposed to a Thunder Stone. In Alola, it evolves into Alolan Raichu when exposed to a Thunder Stone. Additionally, Pikachu has four forms: Cosplay Pikachu, Pikachu in a cap, the partner Pikachu, and Gigantamax Pikachu. Cosplay Pikachu, Pikachu in a cap, the partner Pikachu, and Pikachu with the Gigantamax Factor cannot evolve. The starter Pikachu from Pokémon Yellow will refuse to evolve into Raichu unless it is traded and evolved on another save file. Pikachu is popularly known as the mascot of the Pokémon franchise and one of Nintendo's major mascots. It is also the game mascot and starter Pokémon of Pokémon Yellow and Let's Go, Pikachu!, and has made numerous appearances on the boxes of spin-off titles. Pikachu is also the starter Pokémon of Pokémon Rumble Blast and Pokémon Rumble World.",
    "image": "https://raw.githubusercontent.com/HybridShivam/Pokemon/master/assets/images/025.png"
  },
  {
    "__typename": "Pokemon",
    "name": "Pichu",
    "slug": "pichu",
    "sku": "pichu",
    "description": "Smaller thunder mouse",
    "fullDescription": "Pichu (Japanese: ピチュー Pichu) is an Electric-type baby Pokémon introduced in Generation II. It evolves into Pikachu when leveled up with high friendship, which evolves into Raichu when exposed to a Thunder Stone. Pichu has an alternate form called Spiky-eared Pichu that appeared in Pokémon HeartGold and SoulSilver, as well as the anime and the manga.",
    "image": "https://raw.githubusercontent.com/HybridShivam/Pokemon/master/assets/images/172.png"
  },
  {
    "__typename": "Pokemon",
    "name": "Raichu",
    "slug": "raichu",
    "sku": "raichu",
    "description": "Biggerhunder mouse",
    "fullDescription": "Raichu (Japanese: ライチュウ Raichu) is an Electric-type Pokémon introduced in Generation I. It evolves from Pikachu when exposed to a Thunder Stone. It is the final form of Pichu. In Alola, Raichu has a dual-type Electric/Psychic regional form. It evolves from Pikachu when exposed to a Thunder Stone. All Pikachu in Alola will evolve into this form regardless of their origin. It is the final form of Pichu in the Alola region.",
    "image": "https://raw.githubusercontent.com/HybridShivam/Pokemon/master/assets/images/026.png"
  }
]
